In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv("Social_Network_Ads.csv")

In [5]:
df.sample(2)

      User ID Gender  Age  EstimatedSalary  Purchased
152  15699247   Male   31            76000          0
139  15741094   Male   19            25000          0

In [7]:
df.head(2)

    User ID Gender  Age  EstimatedSalary  Purchased
0  15624510   Male   19            19000          0
1  15810944   Male   35            20000          0

In [9]:
df=df.iloc[:,2:]

In [13]:
df.sample(2)

     Age  EstimatedSalary  Purchased
67    23            82000          0
318   45            32000          1

In [15]:
df.head(2)

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0

In [17]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(df.drop(columns="Purchased"),df["Purchased"],test_size=0.2,random_state=42)

In [19]:
x_train.shape

(320, 2)

In [21]:
x_test.shape

(80, 2)

In [23]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train_scaled=sc.fit_transform(x_train)
x_test_scaled=sc.transform(x_test)

In [25]:
x_train.sample(2)

     Age  EstimatedSalary
390   48            33000
340   53           104000

In [27]:
x_train_scaled.sample(2)

AttributeError: 'numpy.ndarray' object has no attribute 'sample'

In [31]:
x_test.sample(2)

    Age  EstimatedSalary
25   47            20000
70   25            80000

In [33]:
x_test_scaled.sample(2)

AttributeError: 'numpy.ndarray' object has no attribute 'sample'

In [39]:
x_train_scaled=pd.DataFrame(x_train_scaled,columns=x_train.columns)

In [43]:
x_test_scaled=pd.DataFrame(x_test_scaled,columns=x_test.columns)

In [45]:
print(round(x_train.describe(),1))

         Age  EstimatedSalary
count  320.0            320.0
mean    37.9          70281.2
std     10.2          34430.6
min     18.0          15000.0
25%     30.0          43000.0
50%     37.0          71000.0
75%     45.0          88000.0
max     60.0         150000.0

In [47]:
print(round(x_train_scaled.describe(),1))

         Age  EstimatedSalary
count  320.0            320.0
mean    -0.0              0.0
std      1.0              1.0
min     -1.9             -1.6
25%     -0.8             -0.8
50%     -0.1              0.0
75%      0.7              0.5
max      2.2              2.3